package org.info.tg_bot.model.enums;

import java.util.Arrays;

public enum BranchType {
    ПЕРВОЕ_СЛЕДСТВЕННОЕ_УПРАВЛЕНИЕ,
    ВТОРОЕ_СЛЕДСТВЕННОЕ_УПРАВЛЕНИЕ,
    ТРЕТЬЕ_СЛЕДСТВЕННОЕ_УПРАВЛЕНИЕ,
    ЧЕТВЕРТОЕ_СЛЕДСТВЕННОЕ_УПРАВЛЕНИЕ,
    УПРАВЛЕНИЕ_ПО_ЗАЩИТЕ_ГОСУДАРСТВЕННЫХ_СЕКРЕТОВ,
    ПЕРВОЕ_ОПЕРАТИВНОЕ_УПРАВЛЕНИЕ,
    ВТОРОЕ_ОПЕРАТИВНОЕ_УПРАВЛЕНИЕ,
    ТРЕТЬЕ_ОПЕРАТИВНОЕ_УПРАВЛЕНИЕ,
    ЧЕТВЕРТОЕ_ОПЕРАТИВНОЕ_УПРАВЛЕНИЕ,
    ПЯТОЕ_ОПЕРАТИВНОЕ_УПРАВЛЕНИЕ_КЫРАН,
    УПРАВЛЕНИЕ_АНАЛТИЧЕСКИХ_РАЗРАБОТОК,
    УПРАВЛЕНИЕ_ПРЕВЕНЦИИ,
    УПРАВЛЕНИЕ_КРИПТОРАЗРАБОТОК_ИНФОРМАЦИОННЫХ_ПРОДУКТОВ_ТАКТИКО_ОПЕРАТИВНОГО_НАЗНАЧЕНИЯ_КРИПТОН,
    ПЕРВОЕ_УПРАВЛЕНИЕ,
    ВТОРОЕ_УПРАВЛЕНИЕ,
    УПРАВЛЕНИЕ_КАДРОВОГО_ОБЕСПЕЧЕНИЯ,
    УПРАВЛЕНИЕ_РАЗВИТИЯ_КАДРОВОГО_ПОТЕНЦИАЛА,
    УПРАВЛЕНИЕ_МОБИЛИЗАЦИОННОЙ_ПОДГОТОВКИ_И_ДЕЖУРНОЙ_ЧАСТИ,
    УПРАВЛЕНИЕ_ОРГАНИЗАЦИОННОЙ_РАБОТЫ,
    УПРАВЛЕНИЕ_ПО_КОНТРОЛЮ_ЗА_РАССМОТРЕНИЕМ_ОБРАЩЕНИЙ_И_ДОКУМЕНТАЦИОННОГО_ОБЕСПЕЧЕНИЯ,
    УПРАВЛЕНИЕ_МЕЖДУНАРОДНОГО_СОТРУДНИЧЕСТВА,
    УПРАВЛЕНИЕ_НОРМОТВОРЧЕСКОЙ_ДЕЯТЕЛЬНОСТИ,
    УПРАВЛЕНИЕ_ПРЕТЕНЗИОННО_ИСКОВОЙ_РАБОТЫ,
    УПРАВЛЕНИЕ_ИНФОРМАЦИОННОЙ_БЕЗОПАСНОСТИ,
    УПРАВЛЕНИЕ_ЦИФРОВОГО_РАЗВИТИЯ,
    УПРАВЛЕНИЕ_БЮДЖЕТНОГО_ПЛАНИРОВАНИЯ_И_БУХГАЛТЕРСКОГО_УЧЕТА,
    УПРАВЛЕНИЕ_ГОСУДАРСТВЕННЫХ_ЗАКУПОК_И_МТО,
    КРИМИНАЛИСТИЧЕСКОЕ_УПРАВЛЕНИЕ;
    public String getDisplayName() {
        return name().replace('_', ' ');
    }

    public static BranchType fromDisplayName(String text) {
        if (text == null || text.isBlank()) return null;
        String normalized = text
                .trim()
                .toUpperCase()
                .replace('Ё', 'Е')
                .replace(' ', '_');

        return Arrays.stream(values())
                .filter(d -> d.name().equalsIgnoreCase(normalized)
                        || d.getDisplayName().equalsIgnoreCase(text)
                        || d.getDisplayName().equalsIgnoreCase(text.replace('ё', 'е')))
                .findFirst()
                .orElse(null);
    }

}
